Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.kms_ebs.data.aws_caller_identity.current[0]: Reading...
module.kms_ebs.data.aws_partition.current[0]: Reading...
module.ec2_instance["kgawsnytest1"].data.aws_partition.current: Reading...
data.aws_iam_policy_document.kms_allow_ec2_ebs: Reading...
data.aws_iam_policy_document.kms_allow_ec2_ebs: Read complete after 0s [id=2679555061]
module.kms_ebs.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.ec2_instance["kgawsnytest1"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ec2_instance["kgawsnytest2"].data.aws_partition.current: Reading...
module.ec2_instance["kgawsnytest2"].data.aws_partition.current: Read complete after 0s [id=aws]
module.kms_ebs.data.aws_caller_identity.current[0]: Read complete after 1s [id=969837447401]
module.kms_ebs.data.aws_iam_policy_document.this[0]: Reading...
module.kms_ebs.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3999885837]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_config_config_rule.ebs_encryption_check will be created
+ resource "aws_config_config_rule" "ebs_encryption_check" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ebs-encryption-check"
      + rule_id  = (known after apply)
      + tags_all = (known after apply)

      + evaluation_mode (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Volume",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "EBS_SNAPSHOT_MANAGED_ENCRYPTION_CHECK"
        }
    }

  # aws_ebs_encryption_by_default.example will be created
+ resource "aws_ebs_encryption_by_default" "example" {
      + enabled = false
      + id      = (known after apply)
    }

  # aws_secretsmanager_secret.ssh_key["kgawsnytest1"] will be created
+ resource "aws_secretsmanager_secret" "ssh_key" {
      + arn                            = (known after apply)
      + description                    = "Private key for kgawsnytest1 EC2"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "kgawsnytest1-ssh-private-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.ssh_key["kgawsnytest2"] will be created
+ resource "aws_secretsmanager_secret" "ssh_key" {
      + arn                            = (known after apply)
      + description                    = "Private key for kgawsnytest2 EC2"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "kgawsnytest2-ssh-private-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.ssh_key["kgawsnytest1"] will be created
+ resource "aws_secretsmanager_secret_version" "ssh_key" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_secretsmanager_secret_version.ssh_key["kgawsnytest2"] will be created
+ resource "aws_secretsmanager_secret_version" "ssh_key" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_security_group.sg_ec2 will be created
+ resource "aws_security_group" "sg_ec2" {
      + arn                    = (known after apply)
      + description            = "Security group for AWS EC2"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound traffic to any destination"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/12",
                  + "10.0.0.0/8",
                ]
              + description      = "Allow Inbound traffic from Kering private networks"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "ec2-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CreationMethod" = "terraform"
          + "Env"            = "nonprod"
          + "Name"           = "ec2-instance"
          + "Owner"          = "self"
          + "Project"        = "921"
          + "Source"         = "manishtoraskar81"
          + "Support"        = "self"
          + "TeamName"       = "my_team"
        }
      + tags_all               = {
          + "CreationMethod" = "terraform"
          + "Env"            = "nonprod"
          + "Name"           = "ec2-instance"
          + "Owner"          = "self"
          + "Project"        = "921"
          + "Source"         = "manishtoraskar81"
          + "Support"        = "self"
          + "TeamName"       = "my_team"
        }
      + vpc_id                 = "vpc-0f8e267e4cb618066"
    }

  # tls_private_key.ssh["kgawsnytest1"] will be created
+ resource "tls_private_key" "ssh" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_private_key.ssh["kgawsnytest2"] will be created
+ resource "tls_private_key" "ssh" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.ec2_instance["kgawsnytest1"].aws_instance.this[0] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-001b528478909f262"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "kgawsnytest1-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-07cc3be1258ee8660"
      + tags                                 = {
          + "Env"  = "nonprod"
          + "Name" = "kgawsnytest1"
        }
      + tags_all                             = {
          + "Env"  = "nonprod"
          + "Name" = "kgawsnytest1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "kgawsnytest1"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {}

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 200
          + volume_id             = (known after apply)
          + volume_size           = 9
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

  # module.ec2_instance["kgawsnytest2"].aws_instance.this[0] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-001b528478909f262"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "kgawsnytest2-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-07cc3be1258ee8660"
      + tags                                 = {
          + "Env"  = "nonprod"
          + "Name" = "kgawsnytest2"
        }
      + tags_all                             = {
          + "Env"  = "nonprod"
          + "Name" = "kgawsnytest2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "kgawsnytest2"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {}

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 200
          + volume_id             = (known after apply)
          + volume_size           = 9
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

  # module.ec2_keys["kgawsnytest1"].aws_key_pair.this[0] will be created
+ resource "aws_key_pair" "this" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "kgawsnytest1-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.ec2_keys["kgawsnytest1"].tls_private_key.this[0] will be created
+ resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.ec2_keys["kgawsnytest2"].aws_key_pair.this[0] will be created
+ resource "aws_key_pair" "this" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "kgawsnytest2-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.ec2_keys["kgawsnytest2"].tls_private_key.this[0] will be created
+ resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.kms_ebs.aws_kms_alias.this["ec2-ebs/fs"] will be created
+ resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ec2-ebs/fs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.kms_ebs.aws_kms_key.this[0] will be created
+ resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS Key to encrypt the EBS file system"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::969837447401:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = 365
      + tags                               = {
          + "CreationMethod" = "terraform"
          + "Env"            = "nonprod"
          + "Owner"          = "self"
          + "Project"        = "921"
          + "Source"         = "manishtoraskar81"
          + "Support"        = "self"
          + "TeamName"       = "my_team"
        }
      + tags_all                           = {
          + "CreationMethod" = "terraform"
          + "Env"            = "nonprod"
          + "Owner"          = "self"
          + "Project"        = "921"
          + "Source"         = "manishtoraskar81"
          + "Support"        = "self"
          + "TeamName"       = "my_team"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66be2ffa8311:4141/lock?id=manishtoraskar81%252Fterraform_ec2%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 17 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
